var skinList = [{
    id: 0, //编号
    step: 15, //***********步数
    randShadow: [1, 6], //生成的随机方块
    eliminate_conent: [], //消除个数
    starCount: 3, //星星总数
    stage_1: 30, //*******阶段一所需要消灭方块总数
    stage_2: 60, //*******阶段二所需要消灭方块总数
    stage_3: 90, //*******阶段三所需要消灭方块总数
    /**
     * 5.5*5.6*5.7为中心点不可填充
     * 6.5*6.6*6.7为中心点不可填充
     * 7.5*7.6*7.7为中心点不可填充
     */
    layout: [
        [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ],
           [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0  ],
        [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ],
           [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0  ],
        [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ],
           [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0  ],
        [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ],
           [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0  ],
        [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ],
           [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0  ],
        [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ],
           [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0  ],
        [ 0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ,  0 ],
    ],
}, 







];
module.exports = skinList;
module.exports.getSkinByID = function (_skinID) {
    return skinList.filter(item => item.id === _skinID)[0];
};